#ifndef GRAM_H
#define GRAM_H

#include "transfer.h"
#include "sha1.h"

#define MAX_GRAM_DESC 2048
#define BUFFER_SIZE   1280

/********************************************************************************************************************
 * @struct	Gram
 * @desc 	数据传输分片报文类，处理数据传输的同步和验证等问题
 * @author  zhonglei
 * @date    2014-06-18
 ********************************************************************************************************************/
typedef struct {
	const void*   _source;            /* 需要传输的数据指针 */
	unsigned long _task;              /* 报文任务号 */
	GramType      _type;              /* 报文类型 */
	size_t        _len;               /* 报文包含的数据长度 */
	size_t        _num;               /* 报文数据在传输任务中的序号 */
	size_t        _cnt;               /* 报文传输任务所包含的全部数据报文数量 */
	size_t        _length;            /* 报文任务数据总长度 */
	char          _data[BUFFER_SIZE]; /* 报文的数据 */
} Gram;

/********************************************************************************************************************
 * @desc	生成传输任务的第一条报文
 * @param 	void* 	data 		需要传输的原始数据
 * @param 	size_t	length 	 	原始数据的长度
 * @param   char* 	storename 	数据将要保存在文件系统中的名字
 * @param 	Gram* 	gram 		保存生成报文的指针
 * @return  bool   				生成成功，返回true，否则，返回false
 ********************************************************************************************************************/
bool first ( const void* data, const size_t length, const char* storename, Gram* gram );

/********************************************************************************************************************
 * @desc	生成参数指定报文的下一条报文
 * @param 	Gram& 	gram 	原始报文
 * @param 	Gram* 	ngram 	保存生成报文的指针 
 * @return  bool   			生成成功，返回true，否则，返回false
 ********************************************************************************************************************/
bool next ( Gram* gram, Gram* ngram );

/********************************************************************************************************************
 * @desc	生成参数指定报文的反馈报文
 * @param 	Gram* 	gram 	 	原始报文
 * @param 	Gram* 	feedback 	保存生成报文的指针 
 * @return  bool   				生成成功，返回true，否则，返回false
 ********************************************************************************************************************/
bool feedback ( const Gram* gram, Gram* feedback );

/********************************************************************************************************************
 * @desc	验证对src指定的原始报文的反馈报文feedback是否有效，有效，返回true， 否则返回false
 * @param 	Gram* 	src 		原始报文
 * @param 	Gram*   feedback	反馈报文
 * @return  int	   				反馈报文出错的位置，0:没有出错，其它的错误请参照Gram的各个field的位置
 ********************************************************************************************************************/
int valid ( const Gram* src, const Gram* feedback );

/********************************************************************************************************************
 * @desc	简要描述数据报文的情况
 * @param 	Gram* 	gram 		原始报文
 * @return 	char* 				保存描述报文描述信息的字符串指针，该存储区域至少要有BUFFER_SIZE个字节大小
 ********************************************************************************************************************/
bool desc ( const Gram* gram, char* descstr );

#endif
